#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/calavia-org/dns-management/runs/run-UmWi1xiRZ6kjHFpa

Waiting for the plan to start...

Terraform v1.1.7
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.this["default"] will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "default"
      + name_servers  = (known after apply)
      + tags          = {
          + "Terraform" = "true"
        }
      + tags_all      = {
          + "Terraform" = "true"
        }
      + zone_id       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + route53_zone_name         = {
      + default = "default"
    }
  + route53_zone_name_servers = {
      + default = (known after apply)
    }
  + route53_zone_zone_id      = {
      + default = (known after apply)
    }

```

</details>

*Pusher: @jcalavia, Action: `pull_request`*